<a href="https://colab.research.google.com/github/lubnataslaq/PYTHON-AND-DATA-ANALYTICS-7-DAYS/blob/main/Python-project-Bootcamp.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

 **TITANIC SURVIVORS ANALYSIS**

**Importing Libraries**

In [4]:
import pandas as pd
import numpy as np

**Uploading Data File**

use Pandas read_csv to read a data file in Python, and use DataFrame to convert data into the data frame.

In [112]:
df = pd.DataFrame(pd.read_csv("train.csv"))
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [51]:
df.shape

(891, 12)

In [15]:
df.describe

<bound method NDFrame.describe of      PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]>

**Handeling Null Values**

Checking if the data set contains null values in each columns and rows. So we can not use data set without removing them.

Steps to treat with these NAN's and missing valeus are:
1- Remove/drop either rows or columns.
2- Fill the missing values with Mean of all these values for that column.

In [52]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

 * Remove any NAN's that are almost more that 35% of the values missing in the data set.

In [24]:
#df.isnull().sum() returns Pandas values with its columns names and 
#sum() will make a total count of null values in the column.
#then storing the column which has more than 35% of NAN FOR column NAN values.

drop_col = df.isnull().sum()[df.isnull().sum() > (35/100 * df.shape[0] )]
drop_col

Cabin    687
dtype: int64

**NOTE** : there is no specific number after which you drop the column.
its just what we decided on our own according to what we want.

In [25]:
#determine the index of that column that we dropped and has large number of NAN

drop_col.index

Index(['Cabin'], dtype='object')

In [53]:
df.drop(drop_col.index,axis=1, inplace= True)
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

In [27]:
df.fillna(df.mean(), inplace= True)
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

* After dropping CABIN column , and replacing the remaining NAN with its mean (as AGE column).

* Because EMBARKED column still contains NAN  so we make seperately from others.

In [30]:
df["Embarked"].describe()

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

We replace/fill NAN values in EMBARKED column with most frequent value S

In [33]:
df["Embarked"].fillna("S", inplace= True)
df.isnull().sum()  # Now all the NAN values in the columns are being filled

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [111]:
df.corr()

             PassengerId  Survived    Pclass  ...      Fare  FamilySize     Alone
PassengerId     1.000000 -0.005007 -0.035144  ...  0.012658   -0.040143  0.057462
Survived       -0.005007  1.000000 -0.338481  ...  0.257307    0.016639 -0.203367
Pclass         -0.035144 -0.338481  1.000000  ... -0.549500    0.065997  0.135207
Sex                  NaN       NaN       NaN  ...       NaN         NaN       NaN
Age             0.036847 -0.077221 -0.369226  ...  0.096067   -0.301914  0.198270
Fare            0.012658  0.257307 -0.549500  ...  1.000000    0.217138 -0.271832
FamilySize     -0.040143  0.016639  0.065997  ...  0.217138    1.000000 -0.690922
Alone           0.057462 -0.203367  0.135207  ... -0.271832   -0.690922  1.000000

[8 rows x 8 columns]

SibSp : No. of siblings/Spouses
Parch : No. of parents/childern

we create a new column that called family_size by combining these two Columns.

In [ ]:
df["FamilySize"]= df["SibSp"]+df["Parch"]
df.drop(["SibSp","Parch"], axis=1 , inplace=True)
df.corr()

FamilySize corr does not have a good relation with Survival Rate.
So lets check if the person Alone or Not.

In [ ]:
df["Alone"] = [0 if df["FamilySize"][i] > 0  else 1 for i in df.index]
df["Alone"]
df.head()

In [92]:
#check the mean for Alone Column with Survived column 
df.groupby(["Alone"])["Survived"].mean()

Alone
0    0.505650
1    0.303538
Name: Survived, dtype: float64

- If a person is **alone(1)** then has low survival rate.
- If a person not **alone (0)** with his family , has a high survival rate so he belonging to a rich class.

In [63]:
df[["Alone", "Fare"]].corr()

          Alone      Fare
Alone  1.000000 -0.271832
Fare  -0.271832  1.000000

if the person is Alone & not alone --> has a high relation with fare(ticket price).

In [114]:
# check the chance of survival rate with sex.
df["Sex"] = [0 if df["Sex"][i] == "male" else 1 for i in df.index]
df["Sex"]

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    1
889    0
890    0
Name: Sex, Length: 891, dtype: int64

In [115]:
#check the mean for sex with survival rate
df.groupby(['Sex'])['Survived'].mean()

Sex
0    0.188908
1    0.742038
Name: Survived, dtype: float64

it shows that females have more chance to survive than males.

In [87]:
df.groupby(["Embarked"])["Survived"].mean()

Embarked
C    0.553571
Q    0.389610
S    0.336957
Name: Survived, dtype: float64

**Conclusion**

* Female passengers have chance over male passengers to survive.
* Passengers are travelling with their famillies have higher survival rate so they belonging to a rich class.
* Passengers who are boarded C : cherbourg survived more than others.
* Passengers who are from high class , have a higher  survival rate.